# 칈NDICE
# **Repsol D4D/D4B**
# **Introducci칩n a Python para An치lisis de Datos 游냀 游늵**
# *Notebook 3: Manipulaci칩n de Datos*

---
### 칈NDICE DE CONTENIDO
1. CAMPOS CONDICIONALES
2. AGREGACIONES
3. UNIR DATAFRAMES
4. EJERCICIOS

### Juan Martin Bellido
* [linkedin.com/in/jmartinbellido](https://www.linkedin.com/in/jmartinbellido/) 
* jmbellido@isdi.education

In [ ]:
# cargamos librer칤as
import pandas as pd
import numpy as np

# CAMPOS CONDICIONALES
---
En notebook anteriores, introducimos la sintaxis necesaria para crear un nuevo campo (columna) en un dataframe. En los ejemplos utilizados hasta el momento, el campo se creaba como resultado de la operaci칩n matem치tica entre una o m치s columnas en el dataframe.

A continuaci칩n, crearemos una nueva columna a partir de una condici칩n *if/else* utilizando la funci칩n *np.where()*. En este caso, el valor del campo dependar치 de una *condici칩n l칩gica*, no de una operaci칩n matem치tica.

```
np.where(condition, value if true, value if false)
```

In [ ]:
# Importamos df
df_jamesbond = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/jamesbond.csv")
df_jamesbond.dtypes # la funci칩n dtypes permite visualizar las variables inclu칤das en un dataframe

Film                  object
Year                   int64
Actor                 object
Director              object
Box Office           float64
Budget               float64
Bond Actor Salary    float64
dtype: object

In [ ]:
# Creamos un nuevo campo con valor condicional
# Asignamos 1 o 0 en funci칩n de si el actor es Sean Connery o no
df_jamesbond["actor_is_Sean_Connery"] = np.where(df_jamesbond["Actor"]=='Sean Connery',1,0)
df_jamesbond[["Actor","actor_is_Sean_Connery"]].head()

          Actor  actor_is_Sean_Connery
0  Sean Connery                      1
1  Sean Connery                      1
2  Sean Connery                      1
3  Sean Connery                      1
4   David Niven                      0

En caso de necesitar crear una l칩gica con m칰ltiples condiciones, podemos anidar funciones np.where().

```
np.where(
  condition 1, 
  value if true,
  np.where(
    condition 2,
    value if true,
    value if false
  )
)
```

In [ ]:
# A continuaci칩n, crearemos un nuevo campo utilizando dos condiciones
# Crearemos un nuevo campo para clasificar pel칤culas en funci칩n del presupuesto
# Clasificaremos las pel칤culas en tres clases: high budget, medium budget, y low budget
df_jamesbond['movie_budget_segment'] = np.where(
    df_jamesbond.Budget > 100     # condition 1
    ,'high budget'                # value if condition 1 is true
    ,np.where(
        df_jamesbond.Budget > 50  # condition 2
        ,'medium budget'          # value if condition 2 is true
        ,'low budget'             # value if false
    )
)
# Nota: las condiciones se ejecutan en orden

In [ ]:
df_jamesbond[['Film','Budget','movie_budget_segment']]

                               Film  Budget movie_budget_segment
0                            Dr. No     7.0           low budget
1             From Russia with Love    12.6           low budget
2                        Goldfinger    18.6           low budget
3                       Thunderball    41.9           low budget
4                     Casino Royale    85.0        medium budget
5               You Only Live Twice    59.9        medium budget
6   On Her Majesty's Secret Service    37.3           low budget
7              Diamonds Are Forever    34.7           low budget
8                  Live and Let Die    30.8           low budget
9       The Man with the Golden Gun    27.7           low budget
10             The Spy Who Loved Me    45.1           low budget
11                        Moonraker    91.5        medium budget
12               For Your Eyes Only    60.2        medium budget
13            Never Say Never Again    86.0        medium budget
14                        Octopussy    53.9        medium budget
15                 A View to a Kill    54.5        medium budget
16             The Living Daylights    68.8        medium budget
17                  Licence to Kill    56.7        medium budget
18                        GoldenEye    76.9        medium budget
19              Tomorrow Never Dies   133.9          high budget
20          The World Is Not Enough   158.3          high budget
21                  Die Another Day   154.2          high budget
22                    Casino Royale   145.3          high budget
23                Quantum of Solace   181.4          high budget
24                          Skyfall   170.2          high budget
25                          Spectre   206.3          high budget

# AGREGACIONES
---
En el contexto del an치lisis de datos, *agregar* data significa realizar c치lculos que permitan resumir informaci칩n, abstrayendo conocimiento de data que se encuentra en estado bruto. *Nota: Se trata del ejercicio que hacemos cada vez que utilizamos una tabla din치mica (pivot table) en Excel*.

Al realizar una agregaci칩n debemos establecer *el tipo de c치lculo que buscamos realizar*. Para ello, utilizamos funciones espec칤ficas: *funciones de agregaci칩n*. 

*Funciones de agregaci칩n*

| Function    | Description                     |
|-------------|---------------------------------|
| count       | Number of non-null observations |
| nunique     | Number of unique values         |
| sum         | Sum of values                   |
| mean        | Mean of values                  |
| median      | Arithmetic median of values     |
| mode        | Mode                            |
| min         | Minimum                         |
| max         | Maximum                         |

In [ ]:
# Importamos df
df_jamesbond = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/jamesbond.csv",index_col="Film")
df_jamesbond.dtypes

Year                   int64
Actor                 object
Director              object
Box Office           float64
Budget               float64
Bond Actor Salary    float64
dtype: object

### Agregaciones b치sicas
---
Comenzaremos realizando agregaciones simplemente utilizando funciones de aggregaci칩n sobre dataframes.

```
df.agg_func()
```

In [ ]:
# Aplicamos una funci칩n de agregaci칩n sobre el dataframe
df_jamesbond.max()
# Obtenemos los valores max para cada una de las variables

Year                           2015
Actor                Timothy Dalton
Director              Terence Young
Box Office                    943.5
Budget                        206.3
Bond Actor Salary              17.9
dtype: object

In [ ]:
# Seleccionamos una variable y aplicamos funci칩n de agregaci칩n
df_jamesbond.Budget.sum().round()
# Anidamos un .round() para redondear decimales

2099.0

In [ ]:
# Seleccionamos una variable y aplicamos funci칩n de agregaci칩n
df_jamesbond.Actor.nunique()
# Existen 7 actores de James Bond (칰nicos) en el dataframe

7

### El m칠todo .agg()
---
Pandas incluye un m칠todo dedicado a agregar data.

```
df.agg({'column':'agg_func'})
```
* Utilizamos un *dictionary* para establacer sobre qu칠 variable realizar qu칠 operaci칩n

In [ ]:
# Agregamos data utilizando .agg()
df_jamesbond.agg({'Actor':"nunique"})

Actor    7
dtype: int64

In [ ]:
# Agregamos la columna "box office", aplicando funciones min(), max() y mean()
df_jamesbond.agg({'Box Office':["min","max","mean"]})
# En este caso, hemos utilizado m치s de una funci칩n de agregaci칩n sobre la misma variable

      Box Office
min   250.900000
max   943.500000
mean  491.611538

In [ ]:
# Agregamos m치s de una columna a침adiendo m칰ltiples elementos en nuestro dictionary
df_jamesbond.agg({
    'Budget':["min","max","median"],           
    'Bond Actor Salary':["min","max","median"]   
    })

        Budget  Bond Actor Salary
min       7.00                0.6
max     206.30               17.9
median   60.05                5.5

### Agregaciones agrupadas
---

Al realizar agregaciones, frecuentemente agrupamos observaciones en una o m치s variables categ칩ricas. 

El m칠todo *groupby()* permite agrupar observaciones para posteriormente agregar seg칰n grupos.

```
object.groupby("column")
```

In [ ]:
# Agregamos dos m칠tricas, seg칰n una variable agrupada
df_jamesbond.groupby("Actor")[["Bond Actor Salary","Box Office"]].max()

                Bond Actor Salary  Box Office
Actor
Daniel Craig                 14.5       943.5
David Niven                   NaN       315.0
George Lazenby                0.6       291.5
Pierce Brosnan               17.9       518.5
Roger Moore                   9.1       535.0
Sean Connery                  5.8       848.1
Timothy Dalton                7.9       313.5

In [ ]:
# Repetimos ejercicio utilizando la funci칩n .agg()
df_jamesbond.groupby("Actor").agg(
    {"Bond Actor Salary":"max","Box Office":"max"}
)

                Bond Actor Salary  Box Office
Actor
Daniel Craig                 14.5       943.5
David Niven                   NaN       315.0
George Lazenby                0.6       291.5
Pierce Brosnan               17.9       518.5
Roger Moore                   9.1       535.0
Sean Connery                  5.8       848.1
Timothy Dalton                7.9       313.5

In [ ]:
# Agregamos salario m치ximo y media de box office, seg칰n actor
## cambiamos los nombres de las variables agregadas
df = df_jamesbond.groupby("Actor").agg(
    {"Bond Actor Salary":"max","Box Office":"mean"}
).sort_values("Bond Actor Salary", ascending=False)

## muchas veces, los nombres que obtenemos por defecto no son representativos de la informaci칩n que almacenan
df = df.rename(columns={'Bond Actor Salary':'total_bond_salary','Box Office':'total_box_office'})

df # invocamos el objeto

                total_bond_salary  total_box_office
Actor
Pierce Brosnan               17.9        471.650000
Daniel Craig                 14.5        691.475000
Roger Moore                   9.1        422.957143
Timothy Dalton                7.9        282.200000
Sean Connery                  5.8        571.114286
George Lazenby                0.6        291.500000
David Niven                   NaN        315.000000

In [ ]:
# Agregamos m칰ltiples m칠tricas utilizando distintas funciones
## al momento de ordenar, debemos utilizar un tuple para poder especificar (i) variable y (ii) funci칩n
df_jamesbond.groupby("Actor").agg(
    {"Bond Actor Salary":["max","sum","mean","size"]
    ,"Budget":["max","min"]}
).sort_values(("Bond Actor Salary","max"),ascending=False) # al ordenar el df, debemos utilizar un "tuple" para definir criterio

               Bond Actor Salary                       Budget
                             max   sum       mean size    max    min
Actor
Pierce Brosnan              17.9  46.5  11.625000    4  158.3   76.9
Daniel Craig                14.5  25.9   8.633333    4  206.3  145.3
Roger Moore                  9.1  16.9   8.450000    7   91.5   27.7
Timothy Dalton               7.9  13.1   6.550000    2   68.8   56.7
Sean Connery                 5.8  20.3   3.383333    7   86.0    7.0
George Lazenby               0.6   0.6   0.600000    1   37.3   37.3
David Niven                  NaN   0.0        NaN    1   85.0   85.0

In [ ]:
# Podemos utilizar m치s de una variable al agregar
## en tal caso, las observaciones se agrupar치n seg칰n estos dos campo combinados
df_jamesbond.groupby(["Director","Actor"]).agg(
    {"Box Office":"median"}
)

                                   Box Office
Director           Actor
Guy Hamilton       Roger Moore         397.15
                   Sean Connery        631.45
Irvin Kershner     Sean Connery        380.00
John Glen          Roger Moore         373.80
                   Timothy Dalton      282.20
Ken Hughes         David Niven         315.00
Lee Tamahori       Pierce Brosnan      465.40
Lewis Gilbert      Roger Moore         534.00
                   Sean Connery        514.20
Marc Forster       Daniel Craig        514.20
Martin Campbell    Daniel Craig        581.50
                   Pierce Brosnan      518.50
Michael Apted      Pierce Brosnan      439.50
Peter R. Hunt      George Lazenby      291.50
Roger Spottiswoode Pierce Brosnan      463.20
Sam Mendes         Daniel Craig        835.10
Terence Young      Sean Connery        543.80

# UNIR DATAFRAMES
---
Con frecuencia nos vemos obligados a unir dos o m치s dataframes. Al unir dos dataframes, podemos estar realizando dos operaciones distintas:
*   Concatenaci칩n (unir por filas, tambi칠n denominado *unions*);
*   Joins (unir columnas seg칰n alg칰n campo en com칰n)

In [ ]:
# Importamos df
df_jamesbond = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/jamesbond.csv",index_col="Film")
df_jamesbond.dtypes

Year                   int64
Actor                 object
Director              object
Box Office           float64
Budget               float64
Bond Actor Salary    float64
dtype: object

### Unir por filas (unions)
---

Uniremos dos dataframes utilizando la funci칩n *concat()*. Nota: los datasets deben contener las mismas columnas.

In [ ]:
pd.concat([df_jamesbond.head(2),df_jamesbond.tail(2)])

                       Year         Actor  ... Budget  Bond Actor Salary
Film                                       ...
Dr. No                 1962  Sean Connery  ...    7.0                0.6
From Russia with Love  1963  Sean Connery  ...   12.6                1.6
Skyfall                2012  Daniel Craig  ...  170.2               14.5
Spectre                2015  Daniel Craig  ...  206.3                NaN

[4 rows x 6 columns]

### Unir por columnas (joins)
---

La funci칩n *merge()* permite unir ("join") dos dataframes seg칰n columnas. Imitando la l칩gica en SQL, permite elegir entre distintos criterios para el join (*left, right, inner*).

```
df_1.merge(df_2,how='inner',on=None, ...)
```

En caso de que los *keys* (columnas que usamos para unir) tengan nombres distintos en cada tabla, 

```
df_1.merge(df_2,how='inner',left_on='key',right_on='key', ...)
```

In [ ]:
# importamos dataframe con data de albumes
df_albums = pd.read_csv('https://data-wizards.s3.amazonaws.com/datasets/rolling_stones_top_metal_albums.csv')
df_albums.dtypes

AlbumID_Rank              int64
Artist                   object
Album                    object
Release_Year              int64
Spotify_Album            object
Description              object
wiki                     object
Duration                 object
Minutes                   int64
Seconds                   int64
Total_Seconds             int64
Label                    object
Sub_Metal_Genre          object
Rating                  float64
Rolling_Stone_Rating     object
dtype: object

In [ ]:
# importamos dataframe con data de canciones
df_songs = pd.read_csv('https://data-wizards.s3.amazonaws.com/datasets/rolling_stones_top_metal_songs.csv')
df_songs.dtypes

Song Index       int64
Song            object
Artist          object
Track No.        int64
AlbumID_Rank     int64
BPM              int64
Energy           int64
Dance            int64
Loud             int64
Valence          int64
Duration        object
Acoustic         int64
Popularity       int64
Spotify_Song    object
dtype: object

In [ ]:
df_songs[['Song','Artist','AlbumID_Rank']].merge(
    df_albums[['AlbumID_Rank','Album','Release_Year']]  # df secundario
    ,how='left'                                         # definimos el criterio en el join, en este caso elegimos "left"
    ,left_on='AlbumID_Rank'                             # definimos la key (columna) en la tabla principal 
    ,right_on='AlbumID_Rank'                            # key en nuestra tabla secundaria
)

                                        Song  ... Release_Year
0     War Pigs / Luke's Wall - 2014 Remaster  ...         1970
1                   Paranoid - 2016 Remaster  ...         1970
2             Planet Caravan - 2013 Remaster  ...         1970
3                   Iron Man - 2014 Remaster  ...         1970
4           Electric Funeral - 2013 Remaster  ...         1970
...                                      ...  ...          ...
1045                              Sidewinder  ...         2005
1046                          The Wicked End  ...         2005
1047                   Strength of the World  ...         2005
1048                                Betrayed  ...         2005
1049                                  M.I.A.  ...         2005

[1050 rows x 5 columns]

# EJERCICIOS
---

##### EX 1: Campos condicionales
---

El dataset incluye datos de videojuegos. Las ventas figuran en USD millones y est치n divididas por regiones. 

Ejercicio:
* Crear un campo (*total_sales*) en el dataframe que englobe las ventas totales en todas las regiones 
* Crear otro campo (*video_game_segment*) que identifique videojuegos que hayan vendido en total m치s de 30MM ("top sales") vs. el resto ("not top sales")
* Filtrar por videojuegos para la plataforma 'N64' y desplegar columnas; *name*, *platform_code*, *total_sales*, *video_game_segment*

> Dataset https://data-wizards.s3.amazonaws.com/datasets/dataset_videogames_games.csv

In [ ]:
import pandas as pd
import numpy as np
df_videogames = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/dataset_videogames_games.csv")
df_videogames.dtypes

rank               int64
name              object
platform_code     object
year               int64
genre             object
publisher         object
NA_sales         float64
EU_sales         float64
JP_sales         float64
Other_sales      float64
dtype: object

##### EX 2: Agregaciones
---

##### EX 2.1 Calcular suma total de facturaci칩n (revenue), seg칰n sector
##### EX 2.2 Repetir el ejercicio anterior, pero filtrando 칰nicamente por sectores Technology, Energy y Retailing

> Dataset https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv

In [ ]:
import pandas as pd
df_fortune = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv")
df_fortune.dtypes

Rank          int64
Company      object
Sector       object
Industry     object
Location     object
Revenue       int64
Profits       int64
Employees     int64
dtype: object

##### EX 3: Agregaciones
--- 

##### Extrear el top 5 planetas (homeworlds) con mayor n칰mero de personajes inclu칤dos en el dataset.

> Dataset https://data-wizards.s3.amazonaws.com/datasets/starwarsdb_people.csv

In [ ]:
import pandas as pd
df_starwars_people = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/starwarsdb_people.csv")
df_starwars_people.dtypes

name           object
height        float64
mass          float64
hair_color     object
skin_color     object
eye_color      object
birth_year    float64
gender         object
homeworld      object
species        object
sex            object
dtype: object

##### EX 4: Agregaciones 
---

##### Agregar las siguiente m칠tricas seg칰n continente,

*   *Poblaci칩n total*
*   *PIB per c치pita medio*
*   *media de % poblaci칩n viviendo por debajo de la l칤nea de la pobreza*

> Dataset https://data-wizards.s3.amazonaws.com/datasets/dataset_na_who.csv

In [ ]:
import pandas as pd
df_who = pd.read_csv('https://data-wizards.s3.amazonaws.com/datasets/dataset_na_who.csv')
df_who.dtypes

Country                                                    object
CountryID                                                   int64
ContinentID                                                 int64
Adolescent fertility rate (%)                             float64
Adult literacy rate (%)                                   float64
Gross national income per capita (PPP international $)    float64
Net primary school enrolment ratio female (%)             float64
Net primary school enrolment ratio male (%)               float64
Population (in thousands) total                           float64
Population annual growth rate (%)                         float64
Population in urban areas (%)                             float64
Population living below the poverty line                  float64
Continent                                                  object
dtype: object

##### EX 5: Agregaciones
--- 
##### Extrear el top 10 directores con mayor media de IMDB score. Incluir 칰nicamente directores con m치s de 5 pel칤culas dirigidas.

> Dataset https://data-wizards.s3.amazonaws.com/datasets/movies.csv

In [ ]:
import pandas as pd
df_movies = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/movies.csv",index_col="movie_title")
df_movies.dtypes

color                         object
director_name                 object
num_critic_for_reviews       float64
duration                     float64
director_facebook_likes      float64
actor_3_facebook_likes       float64
actor_2_name                  object
actor_1_facebook_likes       float64
gross                        float64
genres                        object
actor_1_name                  object
num_voted_users                int64
cast_total_facebook_likes      int64
actor_3_name                  object
facenumber_in_poster         float64
plot_keywords                 object
movie_imdb_link               object
num_user_for_reviews         float64
language                      object
country                       object
content_rating                object
budget                       float64
title_year                   float64
actor_2_facebook_likes       float64
imdb_score                   float64
aspect_ratio                 float64
movie_facebook_likes           int64
dtype: object

##### EX 6: Agregaciones
---
##### 6.1. Crear un nuevo campo ("company_size") que clasifique a las empresas seg칰n cantidad de empleados. Utilizar el siguiente criterio:

*   *large*, cuando la cantidad de empleados sea mayor o igual a 100.000
*   *mid-size*, cuando la cantidad de empleados sea mayor o igual a 10.000 y menor a 100.000
*   *small*, cuando la cantidad de empleados sea menor a 10.000

##### 6.2. Calcular mediana de ganancias (*profits*), seg칰n (i) sector y (ii) tama침o de empresa ("company_size")

> Dataset https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv

In [ ]:
import pandas as pd
import numpy as np
df_fortune = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv")
df_fortune.dtypes

Rank          int64
Company      object
Sector       object
Industry     object
Location     object
Revenue       int64
Profits       int64
Employees     int64
dtype: object